controllers/ProjectController.php

    protected function findModel($id)
    {
        if (($model = Project::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `Project` WHERE `id`='3'