controllers/SiteController.php

    public function actionRegister()
    {
        $model = new RegistrationForm();

        if ($model->load(Yii::$app->request->post()) && $model->validate()) {
            // Create a new User instance
            // echo "Register";die;
            $user = new User();
            $user->username = $model->username;
            $user->email = $model->email;
            $user->password = Yii::$app->security->generatePasswordHash($model->password); // Hash the password
            $user->auth_key = Yii::$app->security->generateRandomString(); // Generate a random auth key

            if ($user->save()) {
---
INSERT INTO `user` (`username`, `email`, `password`, `auth_key`) VALUES ('toxsl', 'toxsl@gmail.com', '$2y$13$HkooOUm8FAxg723sFSoXsOt1u9XwwmzlNKhxytA/A/sP31BjNC00m', 'jryuoVdUTzVZnp_F2sCO059mcv-YU2m2')